import image1 from "@/assets/services/اختبار التربة.webp";
import image2 from "@/assets/services/اختبار الدمك (2).webp";
import image3 from "@/assets/services/اختبارات الأسفلت.webp";
import image4 from "@/assets/services/تحليل المواد الكيميائية في التربة .webp";
import image5 from "@/assets/services/كفائة الخرسانه.webp";
import image6 from "@/assets/services/التوصيات الهندسية المتكاملة.webp";
import image7 from "@/assets/services/الجيوتقنية.webp";

export const cardDetails = [
  {
    title: "فحص التربة وتحليل خصائصها",
    image: image1,
    details: `
      <p>نقوم بتحليل التربة بطرق علمية دقيقة لقياس قدرة الأرض على تحمل الأحمال المختلفة. تشمل هذه الاختبارات فحص الخصائص الفيزيائية والميكانيكية للتربة، مثل الكثافة، التدرج الحبيبي، ومقدار التحمل.</p>

      <p class="mt-4">تقييم خصائص الطبقات السطحية والباطنية:</p>
      <ul class="service-list">
        <li>تقييم خصائص الطبقات السطحية والباطنية، سواء كانت ترابية، صخرية أو سبخية.</li>
      </ul>

      <p class="mt-4">إعداد التقارير:</p>
      <ul class="service-list">
        <li>إعداد تقارير شاملة تتضمن التوصيات الهندسية لاختيار نوع الأساسات وطرق تنفيذ أعمال الحفر والردم.</li>
      </ul>
    `,
  },
  {
    title: "الدراسات الجيوتقنية",
    image: image7,
    details: `
      <p>يختص قسمنا الجيوتقني في إعداد دراسات شاملة لأنواع التربة والطبقات الأرضية تحت السطحية، ودراسة الخواص الجيوتقنية للتربة.</p>

      <p class="mt-4">دراسة الخواص الجيوتقنية:</p>
      <ul class="service-list">
        <li>دراسة الخواص الجيوتقنية للتربة، بما في ذلك توزيع الطبقات، الرطوبة، التصريف، والنشاط الزلزالي.</li>
      </ul>

      <p class="mt-4">وضع خطة هندسية:</p>
      <ul class="service-list">
        <li>وضع خطة هندسية دقيقة تضمن استقرار البنية التحتية للمشاريع.</li>
      </ul>
    `,
  },
  {
    title: "اختبارات الأسفلت",
    image: image3,
    details: `
      <p>مختبر رمال الصحراء يقدم خدمات متكاملة في اختبار الأسفلت من خلال إجراء الاختبارات الحقلية والمعملية لضمان جودة الأسفلت المستخدم في المشاريع الإنشائية.</p>

      <p class="mt-4">تشمل الاختبارات:</p>
      <ul class="service-list">
        <li>الحرارة: قياس درجة حرارة الأسفلت أثناء الإنتاج لضمان جودته.</li>
        <li>السماكة: قياس سمك طبقات الأسفلت المطبقة.</li>
        <li>قوة الرص: اختبار قوة رص الأسفلت ودرجة تماسكه لضمان المتانة والفعالية.</li>
      </ul>
    `,
  },
  {
    title: "اختبارات الخرسانة",
    image: image5,
    details: `
      <p class="mt-4"> لكور تست : اختبار مدمر لأخذ عينات من الخرسانة لقياس قوتها في الموقع . </p>
      <p class="mt-4"> شمدت هامر: اختبار غير مدمر لقياس قوة الخرسانة بسرعة باستخدام مطرقة استنادية . </p>
      <p class="mt-4">الخرسانة الصلبة:</p>
      <ul class="service-list">
      <li> اختبار المكعبات: قياس قوة الخرسانة تحت الضغط بعد 7 و28 يومًا.</li>
      <li>اختبار الشقوق: فحص العيوب باستخدام الأشعة السينية أو الموجات فوق الصوتية.</li>
      <li>اختبار امتصاص المياه: قياس قدرة الخرسانة على امتصاص الماء.</li>
      </ul>
      <p class="mt-4 font-bold text-black"> فحص حديد التسليح: هو اختبار يُجرى للتأكد من جودة وتماسك حديد التسليح المستخدم في الخرسانة المسلحة.</p>
    `,
  },
  {
    title: "تحليل المواد الكيميائية في التربة",
    image: image4,
    details: `
      <p>نقدم تحليلًا متخصصًا للمواد الكيميائية التي قد تكون موجودة في التربة، مثل الكلوريدات والسلفات.</p>

      <p class="mt-4">تقييم تأثير المواد الكيميائية:</p>
      <ul class="service-list">
        <li>تقييم تأثير هذه المواد على المنشآت المدفونة داخل التربة لضمان عدم تأثيرها على متانة الخرسانة أو الأساسات.</li>
      </ul>
    `,
  },
  {
    title: "اختبار وفحص التربة",
    image: image2,
    details: `
      <p>نقدم في مختبر رمال الصحراء اختبارات التربة باستخدام تقنيات حديثة، مع ضمان دقة البيانات لتلبية احتياجات المشاريع الهندسية.</p>

      <p class="mt-4">الاختبارات الحقلية والمعملية:</p>
      <ul class="service-list">
        <li>اختبار الاختراق القياسي (SPT)</li>
        <li>اختبار اختراق المخروط (CPT)</li>
        <li>اختبار الدمك (Sand Cone)</li>
        <li>اختبار قرص التحميل</li>
        <li>تحليل خصائص التربة (الرطوبة، الكثافة، القص المباشر...)</li>
      </ul>

      <p class="mt-4">اختبار الدمك:</p>
      <ul class="service-list">
        <li>اختبار الدمك (Sand Cone Test): لقياس كثافة التربة ونسبة الرطوبة.</li>
      </ul>
    `,
  },
  {
    title: "التوصيات الهندسية المتكاملة",
    image: image6,
    details: `
      <p>بناءً على نتائج الاختبارات والدراسات الجيوتقنية، نقدم توصيات هندسية متكاملة لدعم أعمال التأسيس.</p>

      <p class="mt-4">تشمل التوصيات:</p>
      <ul class="service-list">
        <li>اختيار تقنيات الحفر والردم المناسبة.</li>
        <li>طرق تحسين التربة.</li>
        <li>تحديد أنواع الأساسات المثلى التي تضمن استقرار المباني والمنشآت على المدى الطويل.</li>
      </ul>
    `,
  },
];
